foam-v2312/verticalChannel/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         10000;

deltaT          0.01;

writeControl    adjustableRunTime;

writeInterval   0.01;

//purgeWrite      50;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           1;

libs
(
    "libfieldFunctionObjects.so"
    "libUtilityFunctionObjects.so"
);

functions
{
    calc_psi
    {
        libs ( utilityFunctionObjects );
        type coded;
        name calc_psi;
        enabled yes;

        codeExecute
        #{
            const auto& vel =
                mesh().lookupObject<volVectorField>("U");

            label patchID = mesh().boundaryMesh().findPatchID("bottom");

            dimensionedScalar psi
            (
                "psi",
                dimensionSet(0, 2, -1, 1, 0, 0, 0),
                gSum(vel.boundaryField()[patchID].component(1)*mesh().magSf().boundaryField()[patchID])/gSum(mesh().magSf().boundaryField()[patchID])
            );
              
            if (Pstream::myProcNo() == 0)
            {
                std::ofstream out;
                out.precision(8);
                out.open("psi", std::ios::app);
                out <<  mesh().time().timeName() << " " << psi.value() << "\n";
            }
        #};
    }

Tfield
{
    type            scalarTransport;
    libs            ("libsolverFunctionObjects.so");
    writeControl    $writeControl;
    writeInterval   $writeInterval;


    // Optional entries

    // Name of scalar field to transport, default = 's'
    field           T;

    // Name of flux field, default = 'phi'
    phi             phi;

    // Name of density field for compressible cases, default = 'rho'
    rho             rho;

    // Name of phase field to constrain scalar to, default = 'none'
    phase           none;

    // Set the scalar to zero on start/re-start
    resetOnStartUp  no;

    // Name of field to use when looking up schemes from fvSchemes
    // default = <field>
    schemesField    U;


    // Diffusivity

    // Fixed value diffusivity
    D               0.001;

    // Name of field to use as diffusivity, default = 'none'
    nut             none;

    // Run-time selectable sources
    fvOptions
    {
        Tcorrect
        {
            type            scalarCodedSource;
            selectionMode   all;
            fields          ( T );
            name            Tcorrect;

            codeInclude
            #{
            #};

            codeCorrect
            #{
                Info<< "CodeCorrect" << endl << "\n";
                const scalarField& V = mesh_.V();
                //not sure, that is makes sence to couple it in this way.
                const volScalarField& Temp = mesh_.lookupObject<volScalarField>("T");
                const scalar Tb= Temp.weightedAverage(V);
                const scalar Tset = 2;
                const scalar frac = Tset/Tb;
                T = T*1; //eqn.correct(frac);
            #};

            codeConstrain
            #{
                Info<< "CodeConstrain" << endl << "\n";
            #};

            codeAddSup
            #{
                Info << "not adding a Tsource" << endl;
            #};
        }
    }
}
}

// ************************************************************************* //
